Конфигурация отчетов/Documents/ПланРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПланРабот</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СсылкаНаЗаказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеЗадачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусВыполнения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусВыполнения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПланаРабот</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипПланаРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокВыполнении</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланРаботРодитель</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПланРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Объекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФункциональныйТип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФункциональныйТипПлана</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Задачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрогресБар</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоментарийКЗадаче</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Этапы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗадачаСсылка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Задачи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Задача</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокВыполнения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусВыполнения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусВыполнения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентВыполнения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СсылкаНаПланРабот</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПланРабот</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПроцентВыполнения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>5</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрогресБарВыполнения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФлагОбработано</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Открыть</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация отчетов/InformationRegisters/АктивныйЧат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>АктивныйЧат</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПланРабот</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сеанс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация отчетов/Enums/СтатусВыполнения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусВыполнения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОжидании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленаИсполнителю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отложенно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Удалена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация отчетов/Enums/ТипПланаРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипПланаРабот</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Главный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подчиненый</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация отчетов/Enums/ТипЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипЗадач</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Задача</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШаблонДляЗаполнения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация отчетов/Enums/ФункциональныйТипПлана.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ФункциональныйТипПлана</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПланПроект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланЗадача</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация отчетов/Documents/СменаСтатуса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>СменаСтатуса</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СтатусыЗадач_1</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СписокЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовыйСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусВыполнения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация отчетов/Documents/ПланРабот/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОтправитьВРаботу(Команда)
	ОтправитьВРаботуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтправитьВРаботуНаСервере()
	//проверка на уже запущеную задачу
	ТекСтрока = Элементы.Этапы.ТекущаяСтрока;
	Задача = Объект.Этапы.НайтиПоИдентификатору(ТекСтрока);
	Задача.Исполнитель = Объект.Ответственный;
	
	Если ЗначениеЗаполнено(Задача.СсылкаНаПланРабот) Тогда
		Сообщить("Задача уже находится в работе!");
	Иначе
		ДатаДок = Объект.Дата;
		СсылкаНаЗаказКлиент = Объект.СсылкаНаЗаказ;
		Заказ = Задача.Задача; //описание задачи
		Ответственный = Задача.Ответственный;
		СтатусВыполнения = Перечисления.СтатусВыполнения.Создано;
		СрокВыполнения = Задача.СрокВыполнения;
		СсылкаНаПланРабот = Объект.Ссылка;
		ТипПланаРабот = Перечисления.ТипПланаРабот.Подчиненый;
		ОбъектКлиента = Объект.Объект;
		ФункциональныйТип = Перечисления.ТипЗадач.ОпределитьФункцТипЗадачи(Задача.ЗадачаСсылка); //надо получить тип задачи 
		ЗадачаСсылка = Задача.ЗадачаСсылка;
		Задача.СсылкаНаПланРабот = Документы.ПланРабот.СозданиеДокументаПланаРабот(ДатаДок,СсылкаНаЗаказКлиент,Заказ,Ответственный,СтатусВыполнения,
										СрокВыполнения,СсылкаНаПланРабот,ТипПланаРабот,ОбъектКлиента,ФункциональныйТип, ЗадачаСсылка);	
		
		КонецЕсли;
	

	////
	//Для Каждого Задача Из Объект.Этапы Цикл 
	//	//задача без ссылки на план работ является неактивированой
	//	Если Задача.СсылкаНаПланРабот.Пустая() = Истина Тогда
			//создаем план на текущую задачу

//			Прервать;	
//		КонецЕсли;
//		
//				
//	КонецЦикла;
	Документы.СменаСтатуса.СменаСтатуса(,Объект.Ссылка, Задача.СсылкаНаПланРабот,Перечисления.СтатусВыполнения.Выполняется,);
	//СозданиеДокументовИЗаписей.СменаСтатуса(,,Объект.Ссылка,Перечисления.СтатусВыполнения.Выполняется,);
	//Задача.СтатусВыполнения = Перечисления.СтатусВыполнения.Выполняется;
	ОбновитьНаСервере();
	Записать();	
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере()
	НовыйСтатус = Документы.ПланРабот.ПолучениеАктуальногоСтатусаЗадачи(Объект.Ссылка);
	
	Если НовыйСтатус <> Объект.СтатусВыполнения И НовыйСтатус <> Неопределено Тогда
		
		Объект.СтатусВыполнения = НовыйСтатус;
	
	КонецЕсли;

	Для Каждого Этап Из Объект.Этапы Цикл
		НовыйСтатус = Документы.ПланРабот.ПолучениеАктуальногоСтатусаЗадачи(Этап.СсылкаНаПланРабот);
	 	Если НовыйСтатус <> Этап.СтатусВыполнения И НовыйСтатус <> Неопределено Тогда
			
			Этап.СтатусВыполнения = НовыйСтатус;
		КонецЕсли;
			Этап.ПроцентВыполнения = Документы.ПланРабот.ПроцентВыполненияЗадачи(Этап.СсылкаНаПланРабот);
			Этап.ВидПроцентВыполнения = Строка(Этап.ПроцентВыполнения)+ "%";
			
			СтрокаПолных = "";
			СтрокаПустых = "";
			ПолныхСимволов = Этап.ПроцентВыполнения/4;
			ПустыхСимволов = 25 - ПолныхСимволов;
			Для Сч = 1 По ПолныхСимволов Цикл
				СтрокаПолных = СтрокаПолных + "█";
			КонецЦикла;
			Для Сч = 1 По ПустыхСимволов Цикл
				СтрокаПустых = СтрокаПустых + "░";
			КонецЦикла;
			
			Этап.ПрогресБарВыполнения = СтрокаПолных + СтрокаПустых + " " + Формат(Этап.ПроцентВыполнения, "ЧЦ=3; ЧРГ=' '; ЧН=") + "%";

	КонецЦикла;	
	
	
 	
	ПроцентВыполнения = Документы.ПланРабот.ПроцентВыполненияЗадачи(Объект.Ссылка);
	
	
	СтрокаПолных = "";
	СтрокаПустых = "";
	ПолныхСимволов = ПроцентВыполнения/2;
	ПустыхСимволов = 25 - ПолныхСимволов;
	Для Сч = 1 По ПолныхСимволов Цикл
		СтрокаПолных = СтрокаПолных + "█";
	КонецЦикла;
	Для Сч = 1 По ПустыхСимволов Цикл
		СтрокаПустых = СтрокаПустых + "░";
	КонецЦикла;
	
	Объект.ПрогресБар = СтрокаПолных + СтрокаПустых + " " + Формат(ПроцентВыполнения, "ЧЦ=3; ЧРГ=' '; ЧН=") + "%";

	Записать();	
	
КонецПроцедуры

&НаСервере
Процедура ПроверкаСсылокНаЗадачи()
	
	
	Для Каждого Этап Из Объект.Этапы Цикл
		Если ЗначениеЗаполнено(Этап.СсылкаНаПланРабот)=0 Тогда
			Этап.Исполнитель = Объект.Ответственный;
			Этап.СсылкаНаПланРабот = Документы.ПланРабот.СозданиеДокументаПланаРабот(ТекущаяДата(),Объект.СсылкаНаЗаказ,Этап.Задача,Объект.Ответственный,
				Перечисления.СтатусВыполнения.Создано,Этап.СрокВыполнения,Объект.Ссылка,Перечисления.ТипПланаРабот.Подчиненый,
				Объект.Объект, Перечисления.ФункциональныйТипПлана.ПланЗадача, Этап.ЗадачаСсылка);	
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ПроверкаСсылокНаЗадачи();
	ОбновитьНаСервере();
КонецПроцедуры


&НаСервере
Функция ОпределитьВидФормы()
	Если Объект.ФункциональныйТип = Перечисления.ФункциональныйТипПлана.ПланЗадача Тогда
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;
КонецФункции

&НаСервере
Функция ОпределитьДоступность()
	Если Документы.ПланРабот.ПолучениеАктуальногоСтатусаЗадачи(Объект.Ссылка) = Перечисления.СтатусВыполнения.Завершено Тогда
		Возврат Ложь;
	Иначе 
		Возврат Истина;
	КонецЕсли;
КонецФункции

&НаСервере
Функция ОпределитьВидЗадачи()
	Если  Объект.Этапы.Количество()>0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции

&НаСервере
Процедура ОбновитьТипЗадачи()
	Если ОпределитьВидЗадачи()=Истина Тогда
		Объект.ФункциональныйТип = Перечисления.ФункциональныйТипПлана.ПланПроект;	
	Иначе
		Объект.ФункциональныйТип = Перечисления.ФункциональныйТипПлана.ПланЗадача;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидФормы()
	//вид формы проект/задача
	//вид формы завершено/в работе
	//Если ОпределитьВидЗадачи()=Истина Тогда //простая задача
	//	Элементы.Этапы.Видимость=0;
	//Иначе
	//	Элементы.Этапы.Видимость=1;
	//КонецЕсли;
	//
	Если ОпределитьДоступность()=Истина Тогда
		ЭтаФорма.Доступность=Истина;
		Элементы.ПанельУправления.Доступность=Истина;
	Иначе
		ЭтаФорма.Доступность=Ложь;
		Элементы.ПанельУправления.Доступность=Ложь;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьВидФормы();
	ОбновитьТипЗадачи();
	ОбновитьНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ПриПовторномОткрытии()
	ОбновитьВидФормы();
	ОбновитьНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ФункциональныйТипПриИзменении(Элемент)
	ОбновитьВидФормы();
КонецПроцедуры


&НаСервере
Процедура ЗавершитьЗадачуНаСервере()
	Документы.СменаСтатуса.СменаСтатуса(Объект.СсылкаНаЗаказ, Объект.ПланРаботРодитель, Объект.Ссылка, Перечисления.СтатусВыполнения.Завершено,Объект.ФункциональныйТип);
КонецПроцедуры

&НаСервере
Функция ПроверкаЗавершенныхЭтапов()
	Если Объект.ФункциональныйТип = Перечисления.ФункциональныйТипПлана.ПланЗадача Тогда
		Возврат Истина;
	КонецЕсли;
	Для Каждого Этап Из Объект.Этапы Цикл
		ТекСтатус = Документы.ПланРабот.ПолучениеАктуальногоСтатусаЗадачи(Этап.СсылкаНаПланРабот);	
		Если ТекСтатус <> Перечисления.СтатусВыполнения.Завершено Тогда
			Сообщить("Задача не может быть завершена, есть незавершеные этапы!");
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
КонецФункции

&НаСервере
Процедура ОбновитьРеквезитыПрогресса()
	
КонецПроцедуры


&НаКлиенте
Процедура ЗавершитьЗадачу(Команда)
	//проверка что все подчиненные задачи завершены.
	Если ПроверкаЗавершенныхЭтапов() = Ложь Тогда
		Сообщить("Задача не может быть завершена!");
		Возврат;
	КонецЕсли;
	//сменить статус задачи
	ЗавершитьЗадачуНаСервере();
	//обновить реквезиты 
	ОбновитьНаСервере();
	//заблокировать редактирование задачи
	ОбновитьВидФормы();
	//активизация следующей задачи
	//АктивироватьСледующуюЗадачу();
	Закрыть();
КонецПроцедуры


&НаСервере
Процедура АктивироватьСледующуюЗадачу()
	Если Объект.ТипПланаРабот = Перечисления.ТипПланаРабот.Главный Тогда
		Возврат;	
	КонецЕсли;
	//создать план работ
	СсылкаНаНовыйПлан = "";
	ПланРодитель = Объект.ПланРаботРодитель.ПолучитьОбъект();
	Для Каждого Этап Из ПланРодитель.Этапы Цикл
		Если Этап.СсылкаНаПланРабот.Пустая()=Истина Тогда
			ДатаДок = ПланРодитель.Дата;
			СсылкаНаЗаказКлиент = ПланРодитель.СсылкаНаЗаказ;
			Заказ = Этап.ОписаниеЗадачи; //описание задачи
			Ответственный = Этап.Ответственный;
			СтатусВыполнения = Перечисления.СтатусВыполнения.Создано;
			СрокВыполнения = Этап.СрокВыполнения;
			СсылкаНаПланРабот = ПланРодитель.Ссылка;
			ТипПланаРабот = Перечисления.ТипПланаРабот.Подчиненый;
			ОбъектКлиента = ПланРодитель.Объект;
			ФункциональныйТип = Перечисления.ТипЗадач.ОпределитьФункцТипЗадачи(Этап.ЗадачаСсылка); //надо получить тип задачи 
			ЗадачаСсылка = Этап.ЗадачаСсылка;
			Этап.СсылкаНаПланРабот = Документы.ПланРабот.СозданиеДокументаПланаРабот(ДатаДок,СсылкаНаЗаказКлиент,Заказ,Ответственный,СтатусВыполнения,
											СрокВыполнения,СсылкаНаПланРабот,ТипПланаРабот,ОбъектКлиента,ФункциональныйТип, ЗадачаСсылка);	
			СсылкаНаНовыйПлан = Этап.СсылкаНаПланРабот;								
			ПланРодитель.Записать();								
			Прервать;
		КонецЕсли;
	КонецЦикла;
	//смена статуса
	Документы.СменаСтатуса.СменаСтатуса(,, СсылкаНаНовыйПлан,Перечисления.СтатусВыполнения.Создано,);
	//СозданиеДокументовИЗаписей.СменаСтатуса(, , СсылкаНаНовыйПлан, 
	//														Перечисления.СтатусВыполнения.ОтправленаИсполнителю);	
КонецПроцедуры

&НаКлиенте
Процедура АктивизироватьСледующуюЗадачу(Команда)
	АктивироватьСледующуюЗадачу();
КонецПроцедуры

&НаСервере
Функция  ОткрытьНаСервере()
	
	ТекСтрока = Элементы.Этапы.ТекущаяСтрока;
	ЗначенияСтроки = Объект.Этапы.НайтиПоИдентификатору(ТекСтрока);
	
	
	СсылкаНаПроект = ЗначенияСтроки.СсылкаНаПланРабот.Ссылка;
	
	Возврат СсылкаНаПроект;
КонецФункции

&НаКлиенте
Процедура ОткрытьПроект(Команда)
	Парам = Новый Структура;
	СсылкаНаДокумент = ОткрытьНаСервере();
	Если СсылкаНаДокумент.Пустая()=Ложь Тогда  
		Парам.Вставить("Ключ",СсылкаНаДокумент);
		
		ОткрытьФорму("Документ.ПланРабот.Форма.ФормаДокумента",Парам);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОткрытьДиалогНаСервере()

	Диалог = РегистрыСведений.АктивныйЧат.СоздатьНаборЗаписей();
	Диалог.Записывать = Истина;
	СсылкаНаДиалог = Диалог.Добавить();
	
	СсылкаНаДиалог.Сеанс = НомерСоединенияИнформационнойБазы();
	СсылкаНаДиалог.Ссылка = Объект.Ссылка;
	
	Диалог.Записать();
	

КонецПроцедуры // ОткрытьДиалогНаСервере()


&НаКлиенте
Процедура ОткрытьДиалог(Команда)
	//ОткрытьДиалогНаСервере();
	//ОткрытьФорму("Обработка.Диалог.Форма");
	    // Создаем структуру для параметров
    ПараметрыОткрытия = Новый Структура;
    ПараметрыОткрытия.Вставить("СсылкаНаЗадачу", Объект.Ссылка);
	
	ОткрытьФорму("Обработка.ЧатЗадачи.Форма.Форма",ПараметрыОткрытия); 
    // Получаем объект обработки и открываем форму
	//ОбработкаОбъект = Обработки[ИмяОбработки].Создать();
	//ФормаОбработки = ОбработкаОбъект.ПолучитьФорму(, , , ПараметрыОткрытия);
	//ФормаОбработки.Открыть();

КонецПроцедуры

&НаКлиенте
Процедура ЭтапыПриИзменении(Элемент)
	ОбновитьТипЗадачи();
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ОбновитьТипЗадачи();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	ОбновитьТипЗадачи();
КонецПроцедуры

&НаСервере
Процедура СтатусВыполненияПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Объект.СтатусВыполнения)=0 Тогда
		Сообщить("Не заполнен статус задачи!");
		Возврат;
	КонецЕсли;
	
	Документы.СменаСтатуса.СменаСтатуса(,,Объект.Ссылка,Объект.СтатусВыполнения,);
	Записать();
КонецПроцедуры

&НаКлиенте
Процедура СтатусВыполненияПриИзменении(Элемент)
	СтатусВыполненияПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыОткрытьПриИзменении(Элемент)
	Парам = Новый Структура;
	СсылкаНаДокумент = ОткрытьНаСервере();
	Если СсылкаНаДокумент.Пустая()=Ложь Тогда  
		Парам.Вставить("Ключ",СсылкаНаДокумент);
		
		ОткрытьФорму("Документ.ПланРабот.Форма.ФормаДокумента",Парам);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗапланироватьЗадачуНаСервере()
	Если Объект.ФункциональныйТип = Перечисления.ФункциональныйТипПлана.ПланЗадача Тогда
		Если ЗначениеЗаполнено(Объект.СрокВыполнении)=1 Тогда
			ДатаПланированием = Объект.СрокВыполнении;
		Иначе
			ДатаПланированием = ТекущаяДата();
		КонецЕсли;
		Документы.ПланированиеЗадачи.СоздатьДокументПланирования(Объект.Ответственный, Объект.Ссылка, ДатаПланированием);	
	Иначе
		ТекСтрока = Элементы.Этапы.ТекущаяСтрока;
		ЗначенияСтроки = Объект.Этапы.НайтиПоИдентификатору(ТекСтрока);

		СсылкаНаЗадачу = ЗначенияСтроки.СсылкаНаПланРабот;
		ДатаПланирования  = ЗначенияСтроки.СрокВыполнения;
		Если ЗначениеЗаполнено(ДатаПланирования) = Ложь Тогда
			ДатаПланирования = ТекущаяДата();
		КонецЕсли;
		
		Документы.ПланированиеЗадачи.СоздатьДокументПланирования(Объект.Ответственный, СсылкаНаЗадачу, ДатаПланирования);
		ЗначенияСтроки.СрокВыполнения = ДатаПланирования;
		Записать();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗапланироватьЗадачу(Команда)
	ЗапланироватьЗадачуНаСервере();
КонецПроцедуры
